chengxunming/CPU/LPC/Driver/LPC1700CAN.c
/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           LPC1700CAN.c
** Last modified Date:  2009-07-8
** Last Version:        V1.0
** Descriptions:        
**
**--------------------------------------------------------------------------------------------------------
** Created By:          chenyicheng
** Created date:        2011-07-14
** Version:             V1.0
** Descriptions:        First version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:         chenyicheng   
** Modified date:       2011-07-14       
** Version:             V1.0           
** Descriptions:                    
**
*********************************************************************************************************/
#include "LPC1700CAN.h" 
#include "bsp.h" 
//#include <string.h> 
#include "bsp_include.h"

MessageDetail MessageDetailT;
MessageDetail MessageCAN0;                                              /* 引用CAN0通道帧变量           */
MessageDetail MessageCAN1;                                              /* 引用CAN1通道帧变量           */

CAN_MSG_Type	sCANFRAME;
static Frame_DefType receive_Frame,receive_Frame2;

static Status CAN_SendMsg (uint8_t canId, CAN_MSG_Type *CAN_Msg);



/*********************************************************************************************************
** Function name:       Enter_SWRst
** Descriptions:        向PC机发送显示字符。
** input parameters:    Ch:CAN控制器号，0表示第一路CAN
** Output parameters:   无
** Returned value:      0：          失败
**                      1:           成功
*********************************************************************************************************/
unsigned char Enter_SWRst(unsigned char Ch)
{
    unsigned long regaddr;
    REG_CANMOD regmod;
    regaddr = (unsigned long)(&LPC_CAN1->MOD)+Ch*CANOFFSET;            
    regmod.DWord = RGE(regaddr);                                        /* 读取LPC_CAN1->MOD寄存器      */
    regmod.Bits.RM = 1;                                                 /* RM位置"1"                    */
    RGE(regaddr) = regmod.DWord;                                        /* 回写LPC_CAN1->MOD寄存器      */
    regmod.DWord = RGE(regaddr);                                        /* 验证写入值                   */
    return (0 != regmod.Bits.RM)? 1:0; 
}  

/*********************************************************************************************************
** Functoin name:       Quit_SWRst
** Descriptions:        CAN控制器退出软件复位模式
** input paraments:     Ch:     CAN控制器号，0表示第一路CAN
** output paraments:    无    
** Returned values:     0：     失败
**                      1:      成功
*********************************************************************************************************/
unsigned char Quit_SWRst(unsigned char Ch)
{
    unsigned long regaddr;
    REG_CANMOD regmod;
    regaddr = (unsigned long)(&LPC_CAN1->MOD)+Ch*CANOFFSET;            
    regmod.DWord = RGE(regaddr);                                        /* 读取LPC_CAN1->MOD寄存器      */
    regmod.Bits.RM = 0;                                                 /* RM位置"0"                    */
    RGE(regaddr) = regmod.DWord;                                        /* 回写LPC_CAN1->MOD寄存器      */
    regmod.DWord = RGE(regaddr);                                        /* 验证写入值                   */
    return (0 != regmod.Bits.RM)? 0:1; 
}

/*********************************************************************************************************
** Functoin name:       CAN_Init
** Descriptions:        CAN控制器退出软件复位模式
** input paraments:     Ch:     CAN控制器号，0表示第一路CAN
**                      Baud:   CAN波特率值
** output paraments:    无    
** Returned values:     无
*********************************************************************************************************/
void CAN_Init(unsigned char Ch, unsigned long Baud)
{
    unsigned long regaddr;
    uint16_t i;
    i = i;

    switch(Ch){                                                         /* 配置CAN控制器引脚            */
    case 0:
        LPC_SC->PCONP   |= 0x01L<<13;                                   /* 打开CAN控制器电源            */
        LPC_IOCON->P0_0 &= ~0x07;
        LPC_IOCON->P0_0 |= 0x01;                                        /* 选择RD1                      */
        LPC_IOCON->P0_1 &= ~0x07;
        LPC_IOCON->P0_1 |= 0x01;                                        /* 选择TD1                      */
        break;
    case 1:
        LPC_SC->PCONP   |= 0x01L<<14;                                   /* 打开CAN控制器电源            */
        LPC_IOCON->P0_4 &= ~0x07;
        LPC_IOCON->P0_4 |= 0x02;                                        /* 选择RD2                      */
                                                                       
        LPC_IOCON->P0_5 &= ~0x07;
        LPC_IOCON->P0_5 |= 0x02;                                        /* 选择TD2                      */
                                                                       
        break;
    default:
        break;
    }
    
    Enter_SWRst(Ch);

    regaddr = (unsigned long)(&LPC_CAN1->BTR)+Ch*CANOFFSET;
    RGE(regaddr) = Baud;
    
    LPC_CANAF->AFMR = 0x01;                                             /* 设置为关闭模式               */
    if(Ch == 0){                                                                        
        LPC_CAN1->CMR  |= (1 << 1) | (1 << 2) | (1 << 3);               /* 释放接收缓冲区               */                              
         LPC_CAN1->IER |= (1<<0);                                       /* 接收中断使能                 */
         LPC_CAN1->GSR |= (0<<0);
         i = LPC_CAN1->ICR;                                             /* 清中断标志                   */
    } else{
         LPC_CAN2->CMR |= (1 << 1) | (1 << 2) | (1 << 3);
         LPC_CAN2->IER |= (1<<0);
         LPC_CAN2->GSR |= (0<<0);
         i = LPC_CAN2->ICR;
    }

    LPC_CANAF->AFMR = 0x02;                                             /* 设置为旁路模式               */
    Quit_SWRst(Ch);
    
