chengxunming/CPU/LPC/Driver/LPC1700CAN.c
}

/*********************************************************************************************************
** Functoin name:       CANRCV
** Descriptions:        接受CAN帧放在指定的结构体中
** input paraments:     Ch:           CAN控制器号，0表示第一路CAN
**                      *MessageCAN:  存放CAN帧信息的结构体
** output paraments:    无    
** Returned values:     无
*********************************************************************************************************/
unsigned char CANRCV(unsigned char Ch, MessageDetail *MessageCAN)
{
    unsigned long mes;
    unsigned long regaddr;
   
    regaddr = (unsigned long)(&LPC_CAN1->RFS)+Ch*CANOFFSET;             /* 处理DLC、RTR、FF             */
    mes = RGE(regaddr);
    MessageCAN->LEN =  (mes >>16) & 0x0F;                               /* 获取帧长度                   */
    MessageCAN->FF  =  (mes >>31);                                      /* 获取FF                       */
   
    regaddr = (unsigned long)(&LPC_CAN1->RID)+Ch*CANOFFSET;             /* 处理ID                       */
    mes = RGE(regaddr);
    if(MessageCAN->FF) {                                                /* FF为1，ID为29位              */
   
        MessageCAN->CANID = mes & 0x1fffffff;
    } else {                                                            /* FF为0 ，ID为11位             */
        MessageCAN->CANID = mes & 0x000007ff;
    }
   
    regaddr = (unsigned long)(&LPC_CAN1->RDA)+Ch*CANOFFSET;             /* 处理 数据A                   */
    mes = RGE(regaddr);
    MessageCAN->DATAA = mes; 
   
    regaddr = (unsigned long)(&LPC_CAN1->RDB)+Ch*CANOFFSET;             /* 处理 数据B                   */
    mes = RGE(regaddr);
    MessageCAN->DATAB = mes;
   
    return(1);                                        
}

/*********************************************************************************************************
** Functoin name:       Writedetail
** Descriptions:        用户填写发送 帧信息
** input paraments:     LEN:    数据长度
**                      *data:  发送数据所在的数组 
**                      FF:
**                      ID:
** output paraments:    无    
** Returned values:     0：     失败
**                      1:      成功
*********************************************************************************************************/
unsigned char writedetail(unsigned char LEN,unsigned char FF, unsigned int ID,unsigned char *data)
{
    unsigned char i;
    if(LEN>8){
        return(0);
    } 
	else 
	{
        MessageDetailT.LEN=LEN;
        MessageDetailT.FF=FF;
        MessageDetailT.CANID=ID;
        MessageDetailT.DATAA=0;                                            /* 先清零                    */
        MessageDetailT.DATAB=0;
    
        for(i=0;i<LEN;i++) {
            if(i<4){
                MessageDetailT.DATAA |= (*(data+i)<<(i*8)); 
            }  
			else 
			{
                MessageDetailT.DATAB |= (*(data+i)<<((i-4)*8));
            }
        }
		return(1);
    }
}

/*********************************************************************************************************
** Functoin name:       CANSend
** Descriptions:        CAN控制器退出软件复位模式
** input paraments:     Ch:             CAN控制器号，0表示第一路CAN
**                      BUFNum:         选择缓冲区
** output paraments:    MessageDetailT: 报文的特征信息及数据    
** Returned values:     0：             失败
**                      1:              成功
*********************************************************************************************************/
unsigned char CANSend(unsigned char Ch, unsigned char BUFNum)
{
    unsigned long CAN32reg;
    unsigned long regaddr;
    unsigned char FFflag;

    CAN32reg = 0;
    while (!(CAN32reg & (1 << 3))) {
        regaddr = (unsigned long)(&LPC_CAN1->GSR)+Ch*CANOFFSET;         /* 等待上一次发送完成           */
        CAN32reg = RGE(regaddr);
				if(!(CAN32reg & (1 << 3))) 
				{                          													 /* ????????????     */
            delay_ms(1);                                     /* ???????1ms           */
            CAN32reg=(1<<3);                               /* ????? ????          */			
				}
    }
    
    BUFNum-=1;                                                          /* 计算地址方便                 */
    
    regaddr = (unsigned long)(&LPC_CAN1->TFI1)+Ch*CANOFFSET+BUFNum*0X10;/* 3缓冲区间地址差 0x10         */
    CAN32reg = RGE(regaddr);
    CAN32reg &= ~((0x0fL<<16) | (0x01L<<30) | (0x80000000));            /* 清 DLC,RTR.FF位              */
    CAN32reg |= ((unsigned long)MessageDetailT.LEN<<16) | ((unsigned long)MessageDetailT.FF<<31);
    RGE(regaddr)=CAN32reg;
    
    FFflag = MessageDetailT.FF;
    
    regaddr = (unsigned long)(&LPC_CAN1->TID1)+Ch*CANOFFSET+BUFNum*0X10;/* 写帧ID                       */
    CAN32reg = RGE(regaddr);
    if(FFflag){                                                         /* FF为1，ID为29位              */
        CAN32reg &=0x70000000;
        CAN32reg |= (MessageDetailT.CANID & 0x1fffffff);
    }  else{
        CAN32reg &= 0xfffff800;                                         /* FF为0 ，ID为11位             */
        CAN32reg |= (MessageDetailT.CANID & 0x000007ff);
    }
    RGE(regaddr)=CAN32reg;
    regaddr = (unsigned long)(&LPC_CAN1->TDA1)+Ch*CANOFFSET+BUFNum*0X10;/* 写帧数据A                    */
    RGE(regaddr) = MessageDetailT.DATAA;
    
    regaddr = (unsigned long)(&LPC_CAN1->TDB1)+Ch*CANOFFSET+BUFNum*0X10;/* 写帧数据B                    */
    RGE(regaddr) = MessageDetailT.DATAB;
    
    regaddr = (unsigned long)(&LPC_CAN1->CMR)+Ch*CANOFFSET;             /* 写控制寄存器，发送           */
    CAN32reg = RGE(regaddr);
    
    CAN32reg &= ~0x03;
    CAN32reg |= 0x03;
    CAN32reg &= ~((1<<5)|(1<<6)|(1<<7));
    switch(BUFNum){
    case 0: CAN32reg |= 01<<5;break;
    case 1: CAN32reg |= 01<<6;break;
    case 2: CAN32reg |= 01<<7;break;
    default: break;
    }
    RGE(regaddr)=CAN32reg;
    regaddr = (unsigned long)(&LPC_CAN1->GSR)+Ch*CANOFFSET;             /* 查询发送状态                 */
    CAN32reg = RGE(regaddr);

    if(CAN32reg&(1<<3))    {                                            /* 所有的请求已成功完成         */
        return(1);                                                      /* 发送成功返回 1               */
    } else { 
        return (0);                                                     /* 发送失败返回 0               */
    }    
}



