chengxunming/CPU/LPC/Driver/LPC1700CAN.c
//发送CAN数据帧--SSU发送--单帧
Status Send_CAN_DataFrame(uint8_t ch,uint8_t addr,uint8_t *ptr,uint8_t len) //ptr: 数据指针. len: 数据长度 
{
	uint16_t i=0;
	uint32_t SENDID;
	CAN_MSG_Type TxMessage;

	
	SENDID = addr;
	
	TxMessage.format = STD_ID_FORMAT;
	TxMessage.id = SENDID;
	TxMessage.type = DATA_FRAME;
	
    
	if((len<=8)&&(len>0))
	{
		TxMessage.len = len;
		
		if(len<=4)
		{
			for(i=0; i<len; i++)
			{
				TxMessage.dataA[i] = *ptr++;
			}
		}
		else
		{
			for(i=0; i<4; i++)
			{
				TxMessage.dataA[i] = *ptr++;
			}
			for(i=0; i<len-4; i++)
			{
				TxMessage.dataB[i] = *ptr++;
			}
		}
			
	}
	else
	{
		TxMessage.len = 0;
	}	

	return CAN_SendMsg(ch,&TxMessage);;
}
//接收CAN数据帧，作功能识别
void Receive_CAN_DataFrame(MessageDetail* canRx,uint8_t num)
{
	uint8_t *prt_rx;
	if(num!=5)
	{
		ev_CanRespone=CAN_EV_ResFail;
		return;
	}
	prt_rx=(uint8_t *)(&receive_Frame);

	*((uint32_t*)prt_rx)= canRx->DATAA;
	*(prt_rx+4)=canRx->DATAB;
	
	if(DataCheckSum((uint8_t *)(&receive_Frame),4)!=receive_Frame.check_sum)
	{
		ev_CanRespone=CAN_EV_ResFail;
		return;
	}
	
	CAN1_RxMessage_Deal(&receive_Frame);

}
//接收CAN数据帧，作功能识别
void Receive_CAN2_DataFrame(MessageDetail* canRx,uint8_t num)
{
	uint8_t *prt_rx;
	if(num!=5)
	{
		ev_CanRespone=CAN_EV_ResFail;
		return;
	}
	prt_rx=(uint8_t *)(&receive_Frame2);

	*((uint32_t*)prt_rx)= canRx->DATAA;
	*(prt_rx+4)=canRx->DATAB;
	
	if(DataCheckSum((uint8_t *)(&receive_Frame2),4)!=receive_Frame2.check_sum)
	{
		ev_CanRespone=CAN_EV_ResFail;
		return;
	}
	
	CAN2_RxMessage_Deal(&receive_Frame2);

}




/*********************************************************************//**
 * @brief 		Setting CAN baud rate (bps)
 * @param[in] 	canId point to LPC_CAN_TypeDef object, should be:
 * 				- LPC_CAN1: CAN1 peripheral
 * 				- LPC_CAN2: CAN2 peripheral
 * @return 		The pointer to CAN peripheral that's expected to use
 ***********************************************************************/
static LPC_CAN_TypeDef* CAN_GetPointer (uint8_t canId)
{
	LPC_CAN_TypeDef* pCan;

	switch (canId)
	{
		case CAN_ID_1:
			pCan = LPC_CAN1;
			break;

		case CAN_ID_2:
			pCan = LPC_CAN2;
			break;

		default:
			pCan = NULL;
			break;
	}

	return pCan;
}

/********************************************************************//**
 * @brief		Send message data
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @param[in]	CAN_Msg point to the CAN_MSG_Type Structure, it contains message
 * 				information such as: ID, DLC, RTR, ID Format
 * @return 		Status:
 * 				- SUCCESS: send message successfully
 * 				- ERROR: send message unsuccessfully
 *********************************************************************/
Status CAN_SendMsg (uint8_t canId, CAN_MSG_Type *CAN_Msg)
{
	LPC_CAN_TypeDef* pCan = CAN_GetPointer(canId);

	uint32_t data,CAN32reg,regaddr;
	
	CAN32reg = 0;
    while (!(CAN32reg & (1 << 3))) 
	{
        regaddr = (unsigned long)(&pCan->GSR);         /* 等待上一次发送完成           */
        CAN32reg = RGE(regaddr);
		if(!(CAN32reg & (1 << 3))) 
		{                          							
            delay_ms(1);                                
            CAN32reg=(1<<3);                               	
		}
    }

	//Check status of Transmit Buffer 1
	if (pCan->SR & (1 << 2))
	{
		/* Transmit Channel 1 is available */
		/* Write frame informations and frame data into its CANxTFI1,
		 * CANxTID1, CANxTDA1, CANxTDB1 register */
		pCan->TFI1 &= ~ 0x000F0000;

		pCan->TFI1 |= (CAN_Msg->len) << 16;

		if(CAN_Msg->type == REMOTE_FRAME)
		{
			pCan->TFI1 |= (1ul << 30); //set bit RTR
		}
		else
		{
			pCan->TFI1 &= ~(1 << 30);
		}

		if(CAN_Msg->format == EXT_ID_FORMAT)
		{
			pCan->TFI1 |= (1ul << 31); //set bit FF
		}
		else
		{
			pCan->TFI1 &= ~(1ul << 31);
		}

		/* Write CAN ID*/
		pCan->TID1 = CAN_Msg->id;

		/*Write first 4 data bytes*/
		data = (CAN_Msg->dataA[0]) | (((CAN_Msg->dataA[1]))<< 8) | ((CAN_Msg->dataA[2]) << 16) | ((CAN_Msg->dataA[3]) << 24);

		pCan->TDA1 = data;

		/*Write second 4 data bytes*/
		data = (CAN_Msg->dataB[0]) | (((CAN_Msg->dataB[1])) << 8)|((CAN_Msg->dataB[2]) << 16)|((CAN_Msg->dataB[3]) << 24);

		pCan->TDB1 = data;

		 /*Write transmission request*/
		 pCan->CMR = 0x21;

		 return SUCCESS;
	}

	//check status of Transmit Buffer 2
	else if((pCan->SR) & (1 << 10))
	{
		/* Transmit Channel 2 is available */
		/* Write frame informations and frame data into its CANxTFI2,
		 * CANxTID2, CANxTDA2, CANxTDB2 register */
		pCan->TFI2 &= ~0x000F0000;

		pCan->TFI2 |= (CAN_Msg->len) << 16;

		if(CAN_Msg->type == REMOTE_FRAME)
		{
			pCan->TFI2 |= (1ul << 30); //set bit RTR
		}
		else
		{
			pCan->TFI2 &= ~(1ul << 30);
		}

		if(CAN_Msg->format == EXT_ID_FORMAT)
		{
			pCan->TFI2 |= (1ul << 31); //set bit FF
		}
		else
		{
			pCan->TFI2 &= ~(1ul << 31);
		}

		/* Write CAN ID*/
		pCan->TID2 = CAN_Msg->id;

		/*Write first 4 data bytes*/
		data = (CAN_Msg->dataA[0]) | (((CAN_Msg->dataA[1])) << 8) | ((CAN_Msg->dataA[2]) << 16)|((CAN_Msg->dataA[3]) << 24);

		pCan->TDA2 = data;

		/*Write second 4 data bytes*/
		data = (CAN_Msg->dataB[0]) | (((CAN_Msg->dataB[1])) << 8) | ((CAN_Msg->dataB[2]) << 16) | ((CAN_Msg->dataB[3]) << 24);

		pCan->TDB2 = data;

		/*Write transmission request*/
		pCan->CMR = 0x41;

		return SUCCESS;
	}

	//check status of Transmit Buffer 3
	else if (pCan->SR & (1<<18))
	{
		/* Transmit Channel 3 is available */
		/* Write frame informations and frame data into its CANxTFI3,
		 * CANxTID3, CANxTDA3, CANxTDB3 register */
		pCan->TFI3 &= ~0x000F0000;

		pCan->TFI3 |= (CAN_Msg->len) << 16;

		if(CAN_Msg->type == REMOTE_FRAME)
		{
			pCan->TFI3 |= (1ul << 30); //set bit RTR
		}
		else
		{
			pCan->TFI3 &= ~(1ul << 30);
		}

		if(CAN_Msg->format == EXT_ID_FORMAT)
		{
			pCan->TFI3 |= (1ul << 31); //set bit FF
		}
		else
		{
			pCan->TFI3 &= ~(1ul << 31);
		}

		/* Write CAN ID*/
		pCan->TID3 = CAN_Msg->id;

		/*Write first 4 data bytes*/
		data = (CAN_Msg->dataA[0]) | (((CAN_Msg->dataA[1])) << 8) | ((CAN_Msg->dataA[2]) << 16) | ((CAN_Msg->dataA[3]) << 24);

		pCan->TDA3 = data;

