chengxunming/CPU/LPC/Driver/LPC1700CAN.c
		/*Write second 4 data bytes*/
		data = (CAN_Msg->dataB[0]) | (((CAN_Msg->dataB[1])) << 8) | ((CAN_Msg->dataB[2]) << 16) | ((CAN_Msg->dataB[3]) << 24);

		pCan->TDB3 = data;

		/*Write transmission request*/
		pCan->CMR = 0x81;

		return SUCCESS;
	}
	else
	{
		return ERROR;
	}
}




/*********************************************************************************************************
** Functoin name:       CAN_IRQHandler
** Descriptions:        CAN控制器中断处理函数
** input paraments:     无
** output paraments:    无    
** Returned values:     无
*********************************************************************************************************/
void CAN_IRQHandler (void)
{
    unsigned char j;
    unsigned int CAN32reg,mes;
    unsigned int regaddr;
    
    /*
     * 最大CAN通道数为2，分别检测两个通道的中断   
     */
    for(j=0;j<2;j++){                
    
        regaddr = (unsigned long)(&LPC_CAN1->ICR)+j*CANOFFSET;    
        CAN32reg=RGE(regaddr);    
        
        if((CAN32reg&(1<<0))!= 0)                                       /* RI 接收中断                  */
        {

            if(j==0)
            {
               CANRCV(j, &MessageCAN0);                                 /* 收到CAN0中断,接收帧          */
			   
			   //添加用户代码
//			   CAN_Protocol_Process(&MessageCAN0);
               Receive_CAN_DataFrame(&MessageCAN0,MessageCAN0.LEN);
				
               regaddr = (unsigned long)(&LPC_CAN1->CMR)+j*CANOFFSET;                
               mes=RGE(regaddr);
               mes |= (1<<2);                                           /* 释放接收缓冲区               */
               RGE(regaddr)=mes;
            break;
            }
            
            if(j==1)
            {
               CANRCV(j, &MessageCAN1);                                 /* 收到CAN1中断,接收帧          */
			   
				//添加用户代码
//			   CAN_Protocol_Process(&MessageCAN1);
			   Receive_CAN2_DataFrame(&MessageCAN1,MessageCAN1.LEN);

               regaddr = (unsigned long)(&LPC_CAN1->CMR)+j*CANOFFSET;                
               mes=RGE(regaddr);
               mes |= (1<<2);                                           /* 释放接收缓冲区               */
               RGE(regaddr)=mes;
            break;
            }
    
        }
        
         
        /* 根据需要添加
        if((CAN32reg&(1<<1))!= 0)                                       // TI1 第一发送缓冲区发送完成中断

        {
            ;
        }
        if((CAN32reg&(1<<9))!= 0)                                       // TI2 第二发送缓冲区发送完成中断

        {
            ;
        }
        if((CAN32reg&(1<<10))!= 0)                                      // TI3 第三发送缓冲区发送完成中断
        {
            ;
        }
        */
        if((CAN32reg&(1<<7))!= 0)                                       /* BEI 总线错误中断             */
        {
            Enter_SWRst(j);
            regaddr = (unsigned long)(&LPC_CAN1->GSR)+j*CANOFFSET;                
            mes=RGE(regaddr);
            mes &=0x00ff;                                                
            RGE(regaddr)=mes;                                           /*总线错误清除处理              */
            Quit_SWRst(j);
        }
        if((CAN32reg&(1<<6))!= 0)                                       /* ALI 仲裁丢失中断             */
        {
            //添加用户代码
        }
        if((CAN32reg&(1<<3))!= 0)
        {
            //添加用户代码
            //ClrCanDataOver(j);                                        /*释放接收缓冲区                */
        }
        
    }
        
}


/*----------------------------------------------------------------------------
  setup acceptance filter.  CAN controller (0..1)
 *----------------------------------------------------------------------------*/
void CAN_wrFilter (uint32_t ctrl, uint32_t id, uint8_t format)  
{
  static int CAN_std_cnt = 0;
  static int CAN_ext_cnt = 0;
         uint32_t buf0, buf1;
         int cnt1, cnt2, bound1;

  /* Acceptance Filter Memory full */
  if ((((CAN_std_cnt + 1) >> 1) + CAN_ext_cnt) >= 512)
    return;                                       /* error: objects full */

  /* Setup Acceptance Filter Configuration 
    Acceptance Filter Mode Register = Off  */                                 
  LPC_CANAF->AFMR = 0x00000001;

  if (format == STANDARD_FORMAT)  {              /* Add mask for standard identifiers */
    id |= (ctrl) << 13;                        /* Add controller number */
    id &= 0x0000F7FF;                            /* Mask out 16-bits of ID */

    /* Move all remaining extended mask entries one place up                 
       if new entry will increase standard ID filters list   */
    if ((CAN_std_cnt & 0x0001) == 0 && CAN_ext_cnt != 0) {
      cnt1   = (CAN_std_cnt >> 1);
      bound1 = CAN_ext_cnt;
      buf0   = LPC_CANAF_RAM->mask[cnt1];
      while (bound1--)  {
        cnt1++;
        buf1 = LPC_CANAF_RAM->mask[cnt1];
        LPC_CANAF_RAM->mask[cnt1] = buf0;
        buf0 = buf1;
      }        
    }

    if (CAN_std_cnt == 0)  {                     /* For entering first  ID */
      LPC_CANAF_RAM->mask[0] = 0x0000FFFF | (id << 16);
    }  else if (CAN_std_cnt == 1)  {             /* For entering second ID */
      if ((LPC_CANAF_RAM->mask[0] >> 16) > id)
        LPC_CANAF_RAM->mask[0] = (LPC_CANAF_RAM->mask[0] >> 16) | (id << 16);
      else
        LPC_CANAF_RAM->mask[0] = (LPC_CANAF_RAM->mask[0] & 0xFFFF0000) | id;
    }  else  {
      /* Find where to insert new ID */
      cnt1 = 0;
      cnt2 = CAN_std_cnt;
      bound1 = (CAN_std_cnt - 1) >> 1;
      while (cnt1 <= bound1)  {                  /* Loop through standard existing IDs */
        if ((LPC_CANAF_RAM->mask[cnt1] >> 16) > id)  {
          cnt2 = cnt1 * 2;
          break;
        }
        if ((LPC_CANAF_RAM->mask[cnt1] & 0x0000FFFF) > id)  {
          cnt2 = cnt1 * 2 + 1;
          break;
        }
        cnt1++;                                  /* cnt1 = U32 where to insert new ID */
      }                                          /* cnt2 = U16 where to insert new ID */

      if (cnt1 > bound1)  {                      /* Adding ID as last entry */
        if ((CAN_std_cnt & 0x0001) == 0)         /* Even number of IDs exists */
          LPC_CANAF_RAM->mask[cnt1]  = 0x0000FFFF | (id << 16);
        else                                     /* Odd  number of IDs exists */
          LPC_CANAF_RAM->mask[cnt1]  = (LPC_CANAF_RAM->mask[cnt1] & 0xFFFF0000) | id;
      }  else  {
        buf0 = LPC_CANAF_RAM->mask[cnt1];        /* Remember current entry */
        if ((cnt2 & 0x0001) == 0)                /* Insert new mask to even address */
          buf1 = (id << 16) | (buf0 >> 16);
        else                                     /* Insert new mask to odd  address */
          buf1 = (buf0 & 0xFFFF0000) | id;
     
        LPC_CANAF_RAM->mask[cnt1] = buf1;        /* Insert mask */

